# ApplicableSegmentLengthRounding Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
RebarRoundingManager..::..ApplicableSegmentLengthRounding Property
RebarRoundingManager Class See Also
---
The applicable rounding for shared parameters used by rebar.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public double ApplicableSegmentLengthRounding { get; }
```

Visual Basic
---
```text
Public ReadOnly Property ApplicableSegmentLengthRounding As Double
	Get
```

Visual C++
---
```text
public:
property double ApplicableSegmentLengthRounding {
	double get ();
}
```

# Remarks
IsActiveOnElement property of ReinforcementSettings RebarRoundingManager has to be true. ApplicableSegmentLengthRounding is meaningless if ReinforcementSettings RebarRoundingManager IsActiveOnElement is false.
# See Also
RebarRoundingManager Class
Autodesk.Revit.DB.Structure Namespace